apache/nuttx/arch/arm/src/common/stm32/hardware/stm32gxxxxx_dac.h
/****************************************************************************
 * arch/arm/src/common/stm32/hardware/stm32gxxxxx_dac.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed to the Apache Software Foundation (ASF) under one or more
 *  contributor license agreements.  See the NOTICE file distributed with
 *  this work for additional information regarding copyright ownership.  The
 *  ASF licenses this file to you under the Apache License, Version 2.0 (the
 *  "License"); you may not use this file except in compliance with the
 *  License.  You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 *  License for the specific language governing permissions and limitations
 *  under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32GXXXXX_DAC_H
#define __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32GXXXXX_DAC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#define HAVE_IP_DAC_V2
#undef HAVE_IP_DAC_V1           /* No DAC IPv1 */

/* Register Offsets *********************************************************/

#define STM32_DAC_CR_OFFSET            0x0000                         /* DAC control register */
#define STM32_DAC_SWTRIGR_OFFSET       0x0004                         /* DAC software trigger register */
#define STM32_DAC_DHR12R1_OFFSET       0x0008                         /* DAC channel 1 12-bit right-aligned data holding register */
#define STM32_DAC_DHR12L1_OFFSET       0x000c                         /* DAC channel 1 12-bit left aligned data holding register */
#define STM32_DAC_DHR8R1_OFFSET        0x0010                         /* DAC channel 1 8-bit right aligned data holding register */
#define STM32_DAC_DHR12R2_OFFSET       0x0014                         /* DAC channel 2 12-bit right aligned data holding register */
#define STM32_DAC_DHR12L2_OFFSET       0x0018                         /* DAC channel 2 12-bit left aligned data holding register */
#define STM32_DAC_DHR8R2_OFFSET        0x001c                         /* DAC channel 2 8-bit right-aligned data holding register */
#define STM32_DAC_DHR12RD_OFFSET       0x0020                         /* Dual DAC 12-bit right-aligned data holding register */
#define STM32_DAC_DHR12LD_OFFSET       0x0024                         /* DUAL DAC 12-bit left aligned data holding register */
#define STM32_DAC_DHR8RD_OFFSET        0x0028                         /* DUAL DAC 8-bit right aligned data holding register */
#define STM32_DAC_DOR1_OFFSET          0x002c                         /* DAC channel 1 data output register */
#define STM32_DAC_DOR2_OFFSET          0x0030                         /* DAC channel 2 data output register */
#define STM32_DAC_SR_OFFSET            0x0034                         /* DAC status register */
#define STM32_DAC_CCR_OFFSET           0x0038                         /* DAC calibration control register */
#define STM32_DAC_MCR_OFFSET           0x003c                         /* DAC mode control register */
#define STM32_DAC_SHSR1_OFFSET         0x0040                         /* DAC channel 1 sample and hold time register */
#define STM32_DAC_SHSR2_OFFSET         0x0044                         /* DAC channel 2 sample and hold time register */
#define STM32_DAC_SHHR_OFFSET          0x0048                         /* DAC sample and hold time register */
#define STM32_DAC_SHRR_OFFSET          0x004c                         /* DAC sample and hold refresh time register */
#define STM32_DAC_STR1_OFFSET          0x0058                         /* DAC channel 1 sawtooth register */
#define STM32_DAC_STR2_OFFSET          0x005c                         /* DAC channel 2 sawtooth register */
#define STM32_DAC_STMODR_OFFSET        0x0060                         /* DAC sawtooth mode register */

/* Register Addresses *******************************************************/

#ifdef CONFIG_STM32_HAVE_DAC1
/* DAC1 */

#  define STM32_DAC1_CR                (STM32_DAC1_BASE + STM32_DAC_CR_OFFSET)
#  define STM32_DAC1_SWTRIGR           (STM32_DAC1_BASE + STM32_DAC_SWTRIGR_OFFSET)
#  define STM32_DAC1_DHR12R1           (STM32_DAC1_BASE + STM32_DAC_DHR12R1_OFFSET)
#  define STM32_DAC1_DHR12L1           (STM32_DAC1_BASE + STM32_DAC_DHR12L1_OFFSET)
#  define STM32_DAC1_DHR8R1            (STM32_DAC1_BASE + STM32_DAC_DHR8R1_OFFSET)
#  define STM32_DAC1_DHR12R2           (STM32_DAC1_BASE + STM32_DAC_DHR12R2_OFFSET)
#  define STM32_DAC1_DHR12L2           (STM32_DAC1_BASE + STM32_DAC_DHR12L2_OFFSET)
#  define STM32_DAC1_DHR8R2            (STM32_DAC1_BASE + STM32_DAC_DHR8R2_OFFSET)
#  define STM32_DAC1_DHR12RD           (STM32_DAC1_BASE + STM32_DAC_DHR12RD_OFFSET)
#  define STM32_DAC1_DHR12LD           (STM32_DAC1_BASE + STM32_DAC_DHR12LD_OFFSET)
#  define STM32_DAC1_DHR8RD            (STM32_DAC1_BASE + STM32_DAC_DHR8RD_OFFSET)
#  define STM32_DAC1_DOR1              (STM32_DAC1_BASE + STM32_DAC_DOR1_OFFSET)
#  define STM32_DAC1_DOR2              (STM32_DAC1_BASE + STM32_DAC_DOR2_OFFSET)
#  define STM32_DAC1_SR                (STM32_DAC1_BASE + STM32_DAC_SR_OFFSET)
#  define STM32_DAC1_CCR               (STM32_DAC1_BASE + STM32_DAC_CCR_OFFSET)
#  define STM32_DAC1_MCR               (STM32_DAC1_BASE + STM32_DAC_MCR_OFFSET)
#  define STM32_DAC1_SHSR1             (STM32_DAC1_BASE + STM32_DAC_SHSR1_OFFSET)
#  define STM32_DAC1_SHSR2             (STM32_DAC1_BASE + STM32_DAC_SHSR2_OFFSET)
#  define STM32_DAC1_SHHR              (STM32_DAC1_BASE + STM32_DAC_SHHR_OFFSET)
#  define STM32_DAC1_SHRR              (STM32_DAC1_BASE + STM32_DAC_SHRR_OFFSET)
#  define STM32_DAC1_STR1              (STM32_DAC1_BASE + STM32_DAC_STR1_OFFSET)
#  define STM32_DAC1_STR2              (STM32_DAC1_BASE + STM32_DAC_STR2_OFFSET)
#  define STM32_DAC1_STMODR            (STM32_DAC1_BASE + STM32_DAC_STMODR_OFFSET)

