apache/nuttx/arch/arm/src/common/stm32/hardware/stm32gxxxxx_dac.h
#endif /* CONFIG_STM32_HAVE_DAC1 */

#ifdef CONFIG_STM32_HAVE_DAC2
/* DAC2 */

#  define STM32_DAC2_CR                (STM32_DAC2_BASE + STM32_DAC_CR_OFFSET)
#  define STM32_DAC2_SWTRIGR           (STM32_DAC2_BASE + STM32_DAC_SWTRIGR_OFFSET)
#  define STM32_DAC2_DHR12R1           (STM32_DAC2_BASE + STM32_DAC_DHR12R1_OFFSET)
#  define STM32_DAC2_DHR12L1           (STM32_DAC2_BASE + STM32_DAC_DHR12L1_OFFSET)
#  define STM32_DAC2_DHR8R1            (STM32_DAC2_BASE + STM32_DAC_DHR8R1_OFFSET)
#  define STM32_DAC2_DHR12R2           (STM32_DAC2_BASE + STM32_DAC_DHR12R2_OFFSET)
#  define STM32_DAC2_DHR12L2           (STM32_DAC2_BASE + STM32_DAC_DHR12L2_OFFSET)
#  define STM32_DAC2_DHR8R2            (STM32_DAC2_BASE + STM32_DAC_DHR8R2_OFFSET)
#  define STM32_DAC2_DHR12RD           (STM32_DAC2_BASE + STM32_DAC_DHR12RD_OFFSET)
#  define STM32_DAC2_DHR12LD           (STM32_DAC2_BASE + STM32_DAC_DHR12LD_OFFSET)
#  define STM32_DAC2_DHR8RD            (STM32_DAC2_BASE + STM32_DAC_DHR8RD_OFFSET)
#  define STM32_DAC2_DOR1              (STM32_DAC2_BASE + STM32_DAC_DOR1_OFFSET)
#  define STM32_DAC2_DOR2              (STM32_DAC2_BASE + STM32_DAC_DOR2_OFFSET)
#  define STM32_DAC2_SR                (STM32_DAC2_BASE + STM32_DAC_SR_OFFSET)
#  define STM32_DAC2_CCR               (STM32_DAC2_BASE + STM32_DAC_CCR_OFFSET)
#  define STM32_DAC2_MCR               (STM32_DAC2_BASE + STM32_DAC_MCR_OFFSET)
#  define STM32_DAC2_SHSR1             (STM32_DAC2_BASE + STM32_DAC_SHSR1_OFFSET)
#  define STM32_DAC2_SHSR2             (STM32_DAC2_BASE + STM32_DAC_SHSR2_OFFSET)
#  define STM32_DAC2_SHHR              (STM32_DAC2_BASE + STM32_DAC_SHHR_OFFSET)
#  define STM32_DAC2_SHRR              (STM32_DAC2_BASE + STM32_DAC_SHRR_OFFSET)
#  define STM32_DAC2_STR1              (STM32_DAC2_BASE + STM32_DAC_STR1_OFFSET)
#  define STM32_DAC2_STR2              (STM32_DAC2_BASE + STM32_DAC_STR2_OFFSET)
#  define STM32_DAC2_STMODR            (STM32_DAC2_BASE + STM32_DAC_STMODR_OFFSET)

#endif /* CONFIG_STM32_HAVE_DAC2 */

#ifdef CONFIG_STM32_HAVE_DAC3
/* DAC3 */

#  define STM32_DAC3_CR                (STM32_DAC3_BASE + STM32_DAC_CR_OFFSET)
#  define STM32_DAC3_SWTRIGR           (STM32_DAC3_BASE + STM32_DAC_SWTRIGR_OFFSET)
#  define STM32_DAC3_DHR12R1           (STM32_DAC3_BASE + STM32_DAC_DHR12R1_OFFSET)
#  define STM32_DAC3_DHR12L1           (STM32_DAC3_BASE + STM32_DAC_DHR12L1_OFFSET)
#  define STM32_DAC3_DHR8R1            (STM32_DAC3_BASE + STM32_DAC_DHR8R1_OFFSET)
#  define STM32_DAC3_DHR12R2           (STM32_DAC3_BASE + STM32_DAC_DHR12R2_OFFSET)
#  define STM32_DAC3_DHR12L2           (STM32_DAC3_BASE + STM32_DAC_DHR12L2_OFFSET)
#  define STM32_DAC3_DHR8R2            (STM32_DAC3_BASE + STM32_DAC_DHR8R2_OFFSET)
#  define STM32_DAC3_DHR12RD           (STM32_DAC3_BASE + STM32_DAC_DHR12RD_OFFSET)
#  define STM32_DAC3_DHR12LD           (STM32_DAC3_BASE + STM32_DAC_DHR12LD_OFFSET)
#  define STM32_DAC3_DHR8RD            (STM32_DAC3_BASE + STM32_DAC_DHR8RD_OFFSET)
#  define STM32_DAC3_DOR1              (STM32_DAC3_BASE + STM32_DAC_DOR1_OFFSET)
#  define STM32_DAC3_DOR2              (STM32_DAC3_BASE + STM32_DAC_DOR2_OFFSET)
#  define STM32_DAC3_SR                (STM32_DAC3_BASE + STM32_DAC_SR_OFFSET)
#  define STM32_DAC3_CCR               (STM32_DAC3_BASE + STM32_DAC_CCR_OFFSET)
#  define STM32_DAC3_MCR               (STM32_DAC3_BASE + STM32_DAC_MCR_OFFSET)
#  define STM32_DAC3_SHSR1             (STM32_DAC3_BASE + STM32_DAC_SHSR1_OFFSET)
#  define STM32_DAC3_SHSR2             (STM32_DAC3_BASE + STM32_DAC_SHSR2_OFFSET)
#  define STM32_DAC3_SHHR              (STM32_DAC3_BASE + STM32_DAC_SHHR_OFFSET)
#  define STM32_DAC3_SHRR              (STM32_DAC3_BASE + STM32_DAC_SHRR_OFFSET)
#  define STM32_DAC3_STR1              (STM32_DAC3_BASE + STM32_DAC_STR1_OFFSET)
#  define STM32_DAC3_STR2              (STM32_DAC3_BASE + STM32_DAC_STR2_OFFSET)
#  define STM32_DAC3_STMODR            (STM32_DAC3_BASE + STM32_DAC_STMODR_OFFSET)

#endif /* CONFIG_STM32_HAVE_DAC3 */

/* Register Bitfield Definitions ********************************************/

/* DAC control register (CR) */

/* These definitions may be used for 16-bit values of either channel: Leave
 * as-is for use with DAC channel 1 or shift left by 16 for use with DAC
 * channel 2.
 */

#define DAC_CR_EN                      (1 << 0)                       /* Bit 0: DAC channel enable */
#define DAC_CR_TEN                     (1 << 1)                       /* Bit 2: DAC channel trigger enable */
#define DAC_CR_TSEL_SHIFT              (2)                            /* Bits 2-5: DAC channel trigger selection */
#define DAC_CR_TSEL_MASK               (0xf << DAC_CR_TSEL_SHIFT)     /* Possible values for TSEL follow: */
#  define DAC_CR_TSEL_SW               (0x0 << DAC_CR_TSEL_SHIFT)     /* SWTRIG1 */
#  define DAC_CR_TSEL_TIM8             (0x1 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg1 - TIM8_TRGO */
#  define DAC_CR_TSEL_TIM7             (0x2 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg2 - TIM7_TRGO */
#  define DAC_CR_TSEL_TIM15            (0x3 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg3 - TIM15_TRGO */
#  define DAC_CR_TSEL_TIM2             (0x4 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg4 - TIM2_TRGO */
#  define DAC_CR_TSEL_TIM4             (0x5 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg5 - TIM4_TRGO */
#  define DAC_CR_TSEL_EXTI9            (0x6 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg6 - EXTI9 */
#  define DAC_CR_TSEL_TIM6             (0x7 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg7 - TIM6_TRGO */
#  define DAC_CR_TSEL_TIM3             (0x8 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg8 - TIM3_TRGO */
#  define DAC_CR_TSEL_HRT1RTRG1        (0x9 << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg9 -  htrim_dac_reset_trg1 */
#  define DAC_CR_TSEL_HRT1RTRG2        (0xa << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg10 - htrim_dac_reset_trg2 */
#  define DAC_CR_TSEL_HRT1RTRG3        (0xb << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg11 - htrim_dac_reset_trg3 */
#  define DAC_CR_TSEL_HRT1RTRG4        (0xc << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg12 - htrim_dac_reset_trg4 */
#  define DAC_CR_TSEL_HRT1RTRG5        (0xd << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg13 - htrim_dac_reset_trg5 */
#  define DAC_CR_TSEL_HRT1RTRG6        (0xe << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg14 - htrim_dac_reset_trg6 */
#  define DAC_CR_TSEL_HRT1TRG1         (0xf << DAC_CR_TSEL_SHIFT)     /* dac_chx_trg15 - htrim_dac_trg1 */
#define DAC_CR_WAVE_SHIFT              (6)                            /* Bits 6-7: DAC channel noise/triangle wave generation enable */
#define DAC_CR_WAVE_MASK               (0x3 << DAC_CR_WAVE_SHIFT)     /* Possible values for WAVE follow: */
#  define DAC_CR_WAVE_DISABLED         (0x0 << DAC_CR_WAVE_SHIFT)     /* Wave generation disabled */
#  define DAC_CR_WAVE_NOISE            (0x1 << DAC_CR_WAVE_SHIFT)     /* Noise wave generation enabled */
#  define DAC_CR_WAVE_TRIANGLE         (0x2 << DAC_CR_WAVE_SHIFT)     /* Triangle wave generation enabled */
#  define DAC_CR_WAVE_SAWTOOTH         (0x3 << DAC_CR_WAVE_SHIFT)     /* Sawtooth wave generation enabled */
#define DAC_CR_MAMP_SHIFT              (8)                            /* Bits 8-11: DAC channel mask/amplitude selector */
#define DAC_CR_MAMP_MASK               (0xf << DAC_CR_MAMP_SHIFT)     /* Possible values for MASK follow: */
#  define DAC_CR_MAMP_BIT0             (0x0 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bit 0 of LFSR */
#  define DAC_CR_MAMP_BITS1_0          (0x1 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[1:0] of LFSR */
#  define DAC_CR_MAMP_BITS2_0          (0x2 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[2:0] of LFSR */
#  define DAC_CR_MAMP_BITS3_0          (0x3 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[3:0] of LFSR */
#  define DAC_CR_MAMP_BITS4_0          (0x4 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[4:0] of LFSR */
#  define DAC_CR_MAMP_BITS5_0          (0x5 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[5:0] of LFSR */
#  define DAC_CR_MAMP_BITS6_0          (0x6 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[6:0] of LFSR */
#  define DAC_CR_MAMP_BITS7_0          (0x7 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[7:0] of LFSR */
#  define DAC_CR_MAMP_BITS8_0          (0x8 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[8:0] of LFSR */
#  define DAC_CR_MAMP_BITS9_0          (0x9 << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[9:0] of LFSR */
#  define DAC_CR_MAMP_BITS10_0         (0xa << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[10:0] of LFSR */
#  define DAC_CR_MAMP_BITS11_0         (0xb << DAC_CR_MAMP_SHIFT)     /* In wave generation mode, unmask bits[11:0] of LFSR */
#  define DAC_CR_MAMP_AMP1             (0x0 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 1 */
#  define DAC_CR_MAMP_AMP3             (0x1 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 3 */
#  define DAC_CR_MAMP_AMP7             (0x2 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 7 */
#  define DAC_CR_MAMP_AMP15            (0x3 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 15 */
#  define DAC_CR_MAMP_AMP31            (0x4 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 31 */
#  define DAC_CR_MAMP_AMP63            (0x5 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 63 */
#  define DAC_CR_MAMP_AMP127           (0x6 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 127 */
#  define DAC_CR_MAMP_AMP255           (0x7 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 255 */
#  define DAC_CR_MAMP_AMP511           (0x8 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 511 */
#  define DAC_CR_MAMP_AMP1023          (0x9 << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 1023 */
#  define DAC_CR_MAMP_AMP2047          (0xa << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 2047 */
#  define DAC_CR_MAMP_AMP4095          (0xb << DAC_CR_MAMP_SHIFT)     /* In triangle generation mode, triangle amplitude 4095 */
#define DAC_CR_DMAEN                   (1 << 12)                      /* Bit 12: DAC channel DMA enable */
#define DAC_CR_DMAUDRIE                (1 << 13)                      /* Bit 13: DAC channel DMA underrun interrupt enable */
#define DAC_CR_CEN                     (1 << 14)                      /* Bit 14: DAC channel calibration enable */

/* These definitions may be used with the full, 32-bit register */

#define DAC_CR_EN1                     (1 << 0)                       /* Bit 0: DAC channel 1 enable */
#define DAC_CR_TEN1                    (1 << 1)                       /* Bit 2: DAC channel 1 trigger enable */
#define DAC_CR_TSEL1_SHIFT             (2)                            /* Bits 2-5: DAC channel 1 trigger selection */
#define DAC_CR_TSEL1_MASK              (0xf << DAC_CR_TSEL1_SHIFT)    /* Possible values for TSEL1 follow: */
#  define DAC_CR_TSEL1_SW              (0x0 << DAC_CR_TSEL1_SHIFT)    /* SWTRIG1 */
#  define DAC_CR_TSEL1_TIM8            (0x1 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg1 - TIM8_TRGO */
#  define DAC_CR_TSEL1_TIM7            (0x2 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg2 - TIM7_TRGO */
#  define DAC_CR_TSEL1_TIM15           (0x3 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg3 - TIM15_TRGO */
#  define DAC_CR_TSEL1_TIM2            (0x4 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg4 - TIM2_TRGO */
#  define DAC_CR_TSEL1_TIM4            (0x5 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg5 - TIM4_TRGO */
#  define DAC_CR_TSEL1_EXTI9           (0x6 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg6 - EXTI9 */
#  define DAC_CR_TSEL1_TIM6            (0x7 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg7 - TIM6_TRGO */
#  define DAC_CR_TSEL1_TIM3            (0x8 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg8 - TIM3_TRGO */
#  define DAC_CR_TSEL1_HRT1RTRG1       (0x9 << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg9 -  htrim_dac_reset_trg1 */
#  define DAC_CR_TSEL1_HRT1RTRG2       (0xa << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg10 - htrim_dac_reset_trg2 */
#  define DAC_CR_TSEL1_HRT1RTRG3       (0xb << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg11 - htrim_dac_reset_trg3 */
#  define DAC_CR_TSEL1_HRT1RTRG4       (0xc << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg12 - htrim_dac_reset_trg4 */
#  define DAC_CR_TSEL1_HRT1RTRG5       (0xd << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg13 - htrim_dac_reset_trg5 */
#  define DAC_CR_TSEL1_HRT1RTRG6       (0xe << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg14 - htrim_dac_reset_trg6 */
#  define DAC_CR_TSEL1_HRT1TRG1        (0xf << DAC_CR_TSEL1_SHIFT)    /* dac_ch1_trg15 - htrim_dac_trg1 */
#define DAC_CR_WAVE1_SHIFT             (6)                            /* Bits 6-7: DAC channel 1 noise/triangle wave generation enable */
#define DAC_CR_WAVE1_MASK              (0x3 << DAC_CR_WAVE1_SHIFT)    /* Possible values for WAVE1 follow: */
#  define DAC_CR_WAVE1_DISABLED        (0x0 << DAC_CR_WAVE1_SHIFT)    /* Wave generation disabled */
#  define DAC_CR_WAVE1_NOISE           (0x1 << DAC_CR_WAVE1_SHIFT)    /* Noise wave generation enabled */
#  define DAC_CR_WAVE1_TRIANGLE        (0x2 << DAC_CR_WAVE1_SHIFT)    /* Triangle wave generation enabled */
#  define DAC_CR_WAVE1_SAWTOOTH        (0x3 << DAC_CR_WAVE1_SHIFT)    /* Sawtooth wave generation enabled */
#define DAC_CR_MAMP1_SHIFT             (8)                            /* Bits 8-11: DAC channel 1 mask/amplitude selector */
#define DAC_CR_MAMP1_MASK              (0xf << DAC_CR_MAMP1_SHIFT)    /* Possible values for MASK1 follow: */
#  define DAC_CR_MAMP1_BIT0            (0x0 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bit 0 of LFSR */
#  define DAC_CR_MAMP1_BITS1_0         (0x1 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[1:0] of LFSR */
#  define DAC_CR_MAMP1_BITS2_0         (0x2 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[2:0] of LFSR */
#  define DAC_CR_MAMP1_BITS3_0         (0x3 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[3:0] of LFSR */
#  define DAC_CR_MAMP1_BITS4_0         (0x4 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[4:0] of LFSR */
#  define DAC_CR_MAMP1_BITS5_0         (0x5 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[5:0] of LFSR */
#  define DAC_CR_MAMP1_BITS6_0         (0x6 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[6:0] of LFSR */
#  define DAC_CR_MAMP1_BITS7_0         (0x7 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[7:0] of LFSR */
#  define DAC_CR_MAMP1_BITS8_0         (0x8 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[8:0] of LFSR */
#  define DAC_CR_MAMP1_BITS9_0         (0x9 << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[9:0] of LFSR */
#  define DAC_CR_MAMP1_BITS10_0        (0xa << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[10:0] of LFSR */
#  define DAC_CR_MAMP1_BITS11_0        (0xb << DAC_CR_MAMP1_SHIFT)    /* In wave generation mode, unmask bits[11:0] of LFSR */
#  define DAC_CR_MAMP1_AMP1            (0x0 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 1 */
#  define DAC_CR_MAMP1_AMP3            (0x1 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 3 */
#  define DAC_CR_MAMP1_AMP7            (0x2 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 7 */
#  define DAC_CR_MAMP1_AMP15           (0x3 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 15 */
#  define DAC_CR_MAMP1_AMP31           (0x4 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 31 */
#  define DAC_CR_MAMP1_AMP63           (0x5 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 63 */
#  define DAC_CR_MAMP1_AMP127          (0x6 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 127 */
#  define DAC_CR_MAMP1_AMP255          (0x7 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 255 */
#  define DAC_CR_MAMP1_AMP511          (0x8 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 511 */
#  define DAC_CR_MAMP1_AMP1023         (0x9 << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 1023 */
#  define DAC_CR_MAMP1_AMP2047         (0xa << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 2047 */
#  define DAC_CR_MAMP1_AMP4095         (0xb << DAC_CR_MAMP1_SHIFT)    /* In triangle generation mode, triangle amplitude 4095 */
#define DAC_CR_DMAEN1                  (1 << 12)                      /* Bit 12: DAC channel 1 DMA enable */
#define DAC_CR_DMAUDRIE1               (1 << 13)                      /* Bit 13: DAC channel 1 DMA underrun interrupt enable */
#define DAC_CR_CEN1                    (1 << 14)                      /* Bit 14: DAC channel 1 calibration enable */

#define DAC_CR_EN2                     (1 << 16)                      /* Bit 16: DAC channel 2 enable */
#define DAC_CR_TEN2                    (1 << 17)                      /* Bit 17: DAC channel 2 trigger enable */
#define DAC_CR_TSEL2_SHIFT             (18)                           /* Bits 18-21: DAC channel 2 trigger selection */
#define DAC_CR_TSEL2_MASK              (0xf << DAC_CR_TSEL2_SHIFT)    /* Possible values for TSEL2 follow: */
#  define DAC_CR_TSEL2_SW              (0x0 << DAC_CR_TSEL2_SHIFT)    /* SWTRIG2 */
#  define DAC_CR_TSEL2_TIM8            (0x1 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg1 - TIM8_TRGO */
#  define DAC_CR_TSEL2_TIM7            (0x2 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg2 - TIM7_TRGO */
#  define DAC_CR_TSEL2_TIM15           (0x3 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg3 - TIM15_TRGO */
#  define DAC_CR_TSEL2_TIM2            (0x4 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg4 - TIM2_TRGO */
#  define DAC_CR_TSEL2_TIM4            (0x5 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg5 - TIM4_TRGO */
#  define DAC_CR_TSEL2_EXTI9           (0x6 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg6 - EXTI9 */
#  define DAC_CR_TSEL2_TIM6            (0x7 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg7 - TIM6_TRGO */
#  define DAC_CR_TSEL2_TIM3            (0x8 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg8 - TIM3_TRGO */
#  define DAC_CR_TSEL2_HRT1RTRG1       (0x9 << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg9 -  htrim_dac_reset_trg1 */
#  define DAC_CR_TSEL2_HRT1RTRG2       (0xa << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg10 - htrim_dac_reset_trg2 */
#  define DAC_CR_TSEL2_HRT1RTRG3       (0xb << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg11 - htrim_dac_reset_trg3 */
#  define DAC_CR_TSEL2_HRT1RTRG4       (0xc << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg12 - htrim_dac_reset_trg4 */
#  define DAC_CR_TSEL2_HRT1RTRG5       (0xd << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg13 - htrim_dac_reset_trg5 */
#  define DAC_CR_TSEL2_HRT1RTRG6       (0xe << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg14 - htrim_dac_reset_trg6 */
#  define DAC_CR_TSEL2_HRT1TRG1        (0xf << DAC_CR_TSEL2_SHIFT)    /* dac_ch2_trg15 - htrim_dac_trg1 */
#define DAC_CR_WAVE2_SHIFT             (22)                           /* Bits 22-23: DAC channel 2 noise/triangle wave generation enable */
#define DAC_CR_WAVE2_MASK              (0x3 << DAC_CR_WAVE2_SHIFT)    /* Possible values for WAVE2 follow: */
#  define DAC_CR_WAVE2_DISABLED        (0x0 << DAC_CR_WAVE2_SHIFT)    /* Wave generation disabled */
#  define DAC_CR_WAVE2_NOISE           (0x1 << DAC_CR_WAVE2_SHIFT)    /* Noise wave generation enabled */
#  define DAC_CR_WAVE2_TRIANGLE        (0x2 << DAC_CR_WAVE2_SHIFT)    /* Triangle wave generation enabled */
#  define DAC_CR_WAVE2_SAWTOOTH        (0x3 << DAC_CR_WAVE2_SHIFT)    /* Sawtooth wave generation enabled */
#define DAC_CR_MAMP2_SHIFT             (24)                           /* Bits 24-27: DAC channel 2 mask/amplitude selector */
#define DAC_CR_MAMP2_MASK              (0xf << DAC_CR_MAMP2_SHIFT)    /* Possible values for MASK2 follow: */
#  define DAC_CR_MAMP2_BIT0            (0x0 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bit 0 of LFSR */
#  define DAC_CR_MAMP2_BITS1_0         (0x1 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[1:0] of LFSR */
#  define DAC_CR_MAMP2_BITS2_0         (0x2 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[2:0] of LFSR */
#  define DAC_CR_MAMP2_BITS3_0         (0x3 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[3:0] of LFSR */
#  define DAC_CR_MAMP2_BITS4_0         (0x4 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[4:0] of LFSR */
#  define DAC_CR_MAMP2_BITS5_0         (0x5 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[5:0] of LFSR */
#  define DAC_CR_MAMP2_BITS6_0         (0x6 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[6:0] of LFSR */
#  define DAC_CR_MAMP2_BITS7_0         (0x7 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[7:0] of LFSR */
#  define DAC_CR_MAMP2_BITS8_0         (0x8 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[8:0] of LFSR */
#  define DAC_CR_MAMP2_BITS9_0         (0x9 << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[9:0] of LFSR */
#  define DAC_CR_MAMP2_BITS10_0        (0xa << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[10:0] of LFSR */
#  define DAC_CR_MAMP2_BITS11_0        (0xb << DAC_CR_MAMP2_SHIFT)    /* In wave generation mode, unmask bits[11:0] of LFSR */
#  define DAC_CR_MAMP2_AMP1            (0x0 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 1 */
#  define DAC_CR_MAMP2_AMP3            (0x1 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 3 */
#  define DAC_CR_MAMP2_AMP7            (0x2 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 7 */
#  define DAC_CR_MAMP2_AMP15           (0x3 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 15 */
#  define DAC_CR_MAMP2_AMP31           (0x4 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 31 */
#  define DAC_CR_MAMP2_AMP63           (0x5 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 63 */
#  define DAC_CR_MAMP2_AMP127          (0x6 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 127 */
#  define DAC_CR_MAMP2_AMP255          (0x7 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 255 */
#  define DAC_CR_MAMP2_AMP511          (0x8 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 511 */
#  define DAC_CR_MAMP2_AMP1023         (0x9 << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 1023 */
#  define DAC_CR_MAMP2_AMP2047         (0xa << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 2047 */
#  define DAC_CR_MAMP2_AMP4095         (0xb << DAC_CR_MAMP2_SHIFT)    /* In triangle generation mode, triangle amplitude 4095 */
#define DAC_CR_DMAEN2                  (1 << 28)                      /* Bit 28: DAC channel 2 DMA enable */
#define DAC_CR_DMAUDRIE2               (1 << 29)                      /* Bit 29: DAC channel 2 DMA underrun interrupt enable */
#define DAC_CR_CEN2                    (1 << 30)                      /* Bit 30: DAC channel 2 calibration enable */

