apache/nuttx/arch/arm/src/common/stm32/hardware/stm32gxxxxx_dac.h
/* DAC software trigger register (SWTRGR) */

#define DAC_SWTRIGR_SWTRIG(n)          (1 << ((n) - 1))               /* Software trigger */
#define DAC_SWTRIGR_SWTRIG1            (1 << 0)                       /* Bit 0: DAC channel 1 software trigger */
#define DAC_SWTRIGR_SWTRIG2            (1 << 1)                       /* Bit 1: DAC channel 2 software trigger */

#define DAC_SWTRIGR_SWTRIGB(n)         (1 << ((n) - 1))               /* Software trigger B for sawtooth generation */
#define DAC_SWTRIGR_SWTRIGB1           (1 << 0)                       /* Bit 16: DAC channel 1 software trigger B for sawtooth increment */
#define DAC_SWTRIGR_SWTRIGB2           (1 << 1)                       /* Bit 17: DAC channel 2 software trigger B for sawtooth increment */

/* DAC channels 1/2 12-bit right-aligned data holding register
 * (DHR12R1, DHR12R2)
 */

#define DAC_DHR12R_MASK_SHIFT          (0)                            /* DAC channel 1/2 right-aligned data */
#define DAC_DHR12R_MASK                (0xfff << DAC_DHR12R_MASK_SHIFT)
#define DAC_DHR12R_MASKB_SHIFT         (16)                           /* DAC channel 1/2 right-aligned data B for Double Data Mode */
#define DAC_DHR12R_MASKB               (0xfff << DAC_DHR12R_MASKB_SHIFT)

/* DAC channel 1/2 12-bit left aligned data holding register
 * (DHR12L1, DHR12L2)
 */

#define DAC_DHR12L_MASK_SHIFT          (4)                            /* DAC channel 1/2 left-aligned data */
#define DAC_DHR12L_MASK                (0xfff << DAC_DHR12L_MASK_SHIFT)
#define DAC_DHR12L_MASKB_SHIFT         (20)                           /* DAC channel 1/2 left-aligned data B for Double Data Mode */
#define DAC_DHR12L_MASKB               (0xfff << DAC_DHR12L_MASKB_SHIFT)

/* DAC channel 1/2 8-bit right aligned data holding register
 * (DHR8R1, DHR8R2)
 */

#define DAC_DHR8R_MASK_SHIFT           (0)                            /* DAC channel 1/2 right-aligned data */
#define DAC_DHR8R_MASK                 (0xff << DAC_DHR8R_MASK_SHIFT)
#define DAC_DHR8R_MASKB_SHIFT          (8)                            /* DAC channel 1/2 right-aligned data B for Double Data Mode */
#define DAC_DHR8R_MASKB                (0xff << DAC_DHR8R_MASKB_SHIFT)

/* Dual DAC 12-bit right-aligned data holding register (DHR12RD) */

#define DAC_DHR12RD_DACC_SHIFT(n)      (((n) - 1) << 4)
#define DAC_DHR12RD_DACC_MASK(n)       (0xfff << DAC_DHR12RD_DACC_SHIFT(n))

#define DAC_DHR12RD_DACC1_SHIFT        (0)                            /* Bits 0-11: DAC channel 1 12-bit right-aligned data */
#define DAC_DHR12RD_DACC1_MASK         (0xfff << DAC_DHR12RD_DACC1_SHIFT)
#define DAC_DHR12RD_DACC2_SHIFT        (16)                           /* Bits 16-27: DAC channel 2 12-bit right-aligned data */
#define DAC_DHR12RD_DACC2_MASK         (0xfff << DAC_DHR12RD_DACC2_SHIFT)

/* Dual DAC 12-bit left-aligned data holding register (DHR12LD) */

#define DAC_DHR12LD_DACC_SHIFT(n)      ((((n) - 1) << 4) + 4)
#define DAC_DHR12LD_DACC_MASK(n)       (0xfff << DAC_DHR12LD_DACC_SHIFT(n))

#define DAC_DHR12LD_DACC1_SHIFT        (4)                            /* Bits 4-15: DAC channel 1 12-bit left-aligned data */
#define DAC_DHR12LD_DACC1_MASK         (0xfff << DAC_DHR12LD_DACC1_SHIFT)
#define DAC_DHR12LD_DACC2_SHIFT        (20)                           /* Bits 20-31: DAC channel 2 12-bit left-aligned data */
#define DAC_DHR12LD_DACC2_MASK         (0xfff << DAC_DHR12LD_DACC2_SHIFT)

/* DUAL DAC 8-bit right aligned data holding register (DHR8RD) */

#define DAC_DHR8RD_DACC_SHIFT(n)       (((n) - 1) << 3)
#define DAC_DHR8RD_DACC_MASK(n)        (0xff << DAC_DHR8RD_DACC_SHIFT(n))

#define DAC_DHR8RD_DACC1_SHIFT         (0)                            /* Bits 0-7: DAC channel 1 8-bit right-aligned data */
#define DAC_DHR8RD_DACC1_MASK          (0xff << DAC_DHR8RD_DACC1_SHIFT)
#define DAC_DHR8RD_DACC2_SHIFT         (8)                            /* Bits 8-15: DAC channel 2 8-bit right-aligned data */
#define DAC_DHR8RD_DACC2_MASK          (0xff << DAC_DHR8RD_DACC2_SHIFT)

/* DAC channel 1/2 data output register (DOR1, DOR2) */

#define DAC_DOR_MASK_SHIFT             (0)                            /* DAC channel 1/2 data output */
#define DAC_DOR_MASK                   (0xfff << DAC_DOR_MASK_SHIFT)
#define DAC_DOR_MASKB_SHIFT            (16)                           /* DAC channel 1/2 data output B for Double Data Mode */
#define DAC_DOR_MASKB                  (0xfff << DAC_DOR_MASKB_SHIFT)

/* DAC status register (SR) */

#define DAC_SR_DACRDY(n)               (1 << ((((n) - 1) << 4) + 11))
#define DAC_SR_DAC1RDY                 (1 << 11)                      /* Bit 13: DAC channel 1 ready status bit */
#define DAC_SR_DAC2RDY                 (1 << 27)                      /* Bit 27: DAC channel 2 ready status bit */

#define DAC_SR_DORSTAT(n)              (1 << ((((n) - 1) << 4) + 12))
#define DAC_SR_DORSTAT1                (1 << 12)                      /* Bit 13: DAC channel 1 output register status bit */
#define DAC_SR_DORSTAT2                (1 << 28)                      /* Bit 29: DAC channel 2 output register status bit */

#define DAC_SR_DMAUDR(n)               (1 << ((((n) - 1) << 4) + 13))
#define DAC_SR_DMAUDR1                 (1 << 13)                      /* Bit 13: DAC channel 1 DMA underrun flag */
#define DAC_SR_DMAUDR2                 (1 << 29)                      /* Bit 29: DAC channel 2 DMA underrun flag */

#define DAC_SR_CAL_FLAG(n)             (1 << ((((n) - 1) << 4) + 14))
#define DAC_SR_CAL_FLAG1               (1 << 14)                      /* Bit 13: DAC channel 1 calibration offset status */
#define DAC_SR_CAL_FLAG2               (1 << 30)                      /* Bit 29: DAC channel 2 calibration offset status */

#define DAC_SR_BWST(n)                 (1 << ((((n) - 1) << 4) + 15))
#define DAC_SR_BWST1                   (1 << 15)                      /* Bit 13: DAC channel 1 busy writing sample time flag */
#define DAC_SR_BWST2                   (1 << 31)                      /* Bit 29: DAC channel 2 busy writing sample time flag */

/* DAC calibration control register (CCR) */

