apache/nuttx/arch/arm/src/common/stm32/hardware/stm32gxxxxx_dac.h
#define DAC_CCR_OTRIM_SHIFT(n)         (((n) - 1) << 4)
#define DAC_CCR_OTRIM_MASK(n)          (0x1f << DAC_CCR_OTRIM_SHIFT(n))

#define DAC_CCR_OTRIM1_SHIFT           (0)                            /* DAC channel 1 offset trimming value */
#define DAC_CCR_OTRIM1_MASK            (0x1f << DAC_CCR_OTRIM1_SHIFT)
#define DAC_CCR_OTRIM2_SHIFT           (16)                           /* DAC channel 2 offset trimming value */
#define DAC_CCR_OTRIM2_MASK            (0x1f << DAC_CCR_OTRIM2_SHIFT)

/* DAC mode control register (MCR) */

#define DAC_MCR_MODE_SHIFT(n)          (((n) - 1) << 4)               /* DAC channel 1/2 mode */
#define DAC_MCR_MODE_MASK(n)           (0x7 << DAC_MCR_MODE_SHIFT(n))
#  define DAC_MCR_MODE_0(n)            (0x0 << DAC_MCR_MODE_SHIFT(n)) /* Normal mode, connect to external pin with buffer enabled */
#  define DAC_MCR_MODE_1(n)            (0x1 << DAC_MCR_MODE_SHIFT(n)) /* Normal mode, connect to external pin and to on-chip peripherals with buffer enabled */
#  define DAC_MCR_MODE_2(n)            (0x2 << DAC_MCR_MODE_SHIFT(n)) /* Normal mode, connect to external pin with buffer disabled */
#  define DAC_MCR_MODE_3(n)            (0x3 << DAC_MCR_MODE_SHIFT(n)) /* Normal mode, connect to on-chip peripherals with buffer disabled */
#  define DAC_MCR_MODE_4(n)            (0x4 << DAC_MCR_MODE_SHIFT(n)) /* Sample & hold mode, connect to external pin with buffer enabled */
#  define DAC_MCR_MODE_5(n)            (0x5 << DAC_MCR_MODE_SHIFT(n)) /* Sample & hold mode, connect to external pin and to on-chip peripherals with buffer enabled */
#  define DAC_MCR_MODE_6(n)            (0x6 << DAC_MCR_MODE_SHIFT(n)) /* Sample & hold mode, connect to external pin and to on-chip peripherals with buffer disabled */
#  define DAC_MCR_MODE_7(n)            (0x7 << DAC_MCR_MODE_SHIFT(n)) /* Sample & hold mode, connect to on-chip peripherals with buffer disabled */

#define DAC_MCR_MODE1_SHIFT            (0)                            /* DAC channel 1 mode */
#define DAC_MCR_MODE1_MASK             (0x7 << DAC_MCR_MODE1_SHIFT)
#  define DAC_MCR_MODE1_0              (0x0 << DAC_MCR_MODE1_SHIFT)   /* Normal mode, connect to external pin with buffer enabled */
#  define DAC_MCR_MODE1_1              (0x1 << DAC_MCR_MODE1_SHIFT)   /* Normal mode, connect to external pin and to on-chip peripherals with buffer enabled */
#  define DAC_MCR_MODE1_2              (0x2 << DAC_MCR_MODE1_SHIFT)   /* Normal mode, connect to external pin with buffer disabled */
#  define DAC_MCR_MODE1_3              (0x3 << DAC_MCR_MODE1_SHIFT)   /* Normal mode, connect to on-chip peripherals with buffer disabled */
#  define DAC_MCR_MODE1_4              (0x4 << DAC_MCR_MODE1_SHIFT)   /* Sample & hold mode, connect to external pin with buffer enabled */
#  define DAC_MCR_MODE1_5              (0x5 << DAC_MCR_MODE1_SHIFT)   /* Sample & hold mode, connect to external pin and to on-chip peripherals with buffer enabled */
#  define DAC_MCR_MODE1_6              (0x6 << DAC_MCR_MODE1_SHIFT)   /* Sample & hold mode, connect to external pin and to on-chip peripherals with buffer disabled */
#  define DAC_MCR_MODE1_7              (0x7 << DAC_MCR_MODE1_SHIFT)   /* Sample & hold mode, connect to on-chip peripherals with buffer disabled */

#define DAC_MCR_MODE2_SHIFT            (16)                           /* DAC channel 2 mode */
#define DAC_MCR_MODE2_MASK             (0x7 << DAC_MCR_MODE2_SHIFT)
#  define DAC_MCR_MODE2_0              (0x0 << DAC_MCR_MODE2_SHIFT)   /* Normal mode, connect to external pin with buffer enabled */
#  define DAC_MCR_MODE2_1              (0x1 << DAC_MCR_MODE2_SHIFT)   /* Normal mode, connect to external pin and to on-chip peripherals with buffer enabled */
#  define DAC_MCR_MODE2_2              (0x2 << DAC_MCR_MODE2_SHIFT)   /* Normal mode, connect to external pin with buffer disabled */
#  define DAC_MCR_MODE2_3              (0x3 << DAC_MCR_MODE2_SHIFT)   /* Normal mode, connect to on-chip peripherals with buffer disabled */
#  define DAC_MCR_MODE2_4              (0x4 << DAC_MCR_MODE2_SHIFT)   /* Sample & hold mode, connect to external pin with buffer enabled */
#  define DAC_MCR_MODE2_5              (0x5 << DAC_MCR_MODE2_SHIFT)   /* Sample & hold mode, connect to external pin and to on-chip peripherals with buffer enabled */
#  define DAC_MCR_MODE2_6              (0x6 << DAC_MCR_MODE2_SHIFT)   /* Sample & hold mode, connect to external pin and to on-chip peripherals with buffer disabled */
#  define DAC_MCR_MODE2_7              (0x7 << DAC_MCR_MODE2_SHIFT)   /* Sample & hold mode, connect to on-chip peripherals with buffer disabled */

#define DAC_MCR_DMADOUBLE(n)           (1 << ((((n) - 1) << 4) + 8))  /* DAC Channel 1/2 DMA double data mode */
#define DAC_MCR_DMADOUBLE1             (1 << 8)                       /* DAC Channel 1 DMA double data mode */
#define DAC_MCR_DMADOUBLE2             (1 << 24)                      /* DAC Channel 2 DMA double data mode */

#define DAC_MCR_SINFORMAT(n)           (1 << ((((n) - 1) << 4) + 9))  /* DAC Channel 1/2 enable signed format */
#define DAC_MCR_SINFORMAT1             (1 << 9)                       /* DAC Channel 1 enable signed format */
#define DAC_MCR_SINFORMAT2             (1 << 25)                      /* DAC Channel 2 enable signed format */

#define DAC_MCR_HFSEL_SHIFT            (14)                           /* High-frequency interface mode selection */
#define DAC_MCR_HFSEL_MASK             (0x3 << DAC_MCR_HFSEL_SHIFT)
#  define DAC_MCR_HFSEL_DISABLED       (0x0 << DAC_MCR_HFSEL_SHIFT)   /* High-frequency disabled */
#  define DAC_MCR_HFSEL_AHB_80MHz      (0x1 << DAC_MCR_HFSEL_SHIFT)   /* High-frequency for AHB > 80 MHz */
#  define DAC_MCR_HFSEL_AHB_160MHz     (0x2 << DAC_MCR_HFSEL_SHIFT)   /* High-frequency for AHB > 160 MHz */
#  define DAC_MCR_HFSEL_RESERVED       (0x3 << DAC_MCR_HFSEL_SHIFT)   /* Reserved */

/* DAC channel 1/2 sample and hold sample time register (SHSR1, SHSR2) */

#define DAC_SHSR_TSAMPLE_SHIFT         (0)                            /* DAC channel 1/2 Sample phase time = (TSAMPLE + 1) * LSI/LSE clock period */
#define DAC_SHSR_TSAMPLE_MASK          (0x3ff << DAC_SHSR1_TSAMPLE1_SHIFT)

/* DAC sample and hold time register (SHHR) */

