apache/nuttx/arch/arm/src/common/stm32/hardware/stm32gxxxxx_dac.h
#define DAC_SHHR_THOLD_SHIFT(n)        (((n) - 1) << 4)               /* DAC channel 1/2 Hold time = THOLD * LSI/LSE clock period */
#define DAC_SHHR_THOLD_MASK(n)         (0x3ff << DAC_SHHR_THOLD_SHIFT(n))

#define DAC_SHHR_THOLD1_SHIFT          (0)                            /* DAC channel 1 Hold time */
#define DAC_SHHR_THOLD1_MASK           (0x3ff << DAC_SHHR_THOLD1_SHIFT)
#define DAC_SHHR_THOLD2_SHIFT          (16)                           /* DAC channel 2 Hold time */
#define DAC_SHHR_THOLD2_MASK           (0x3ff << DAC_SHHR_THOLD2_SHIFT)

/* DAC sample and hold refresh time register (SHRR) */

#define DAC_SHHR_TREFRESH_SHIFT(n)     (((n) - 1) << 4)               /* DAC channel 1/2 Refresh time = TREFRESH * LSI/LSE clock period */
#define DAC_SHHR_TREFRESH_MASK(n)      (0xff << DAC_SHHR_THOLD_SHIFT(n))

#define DAC_SHRR_TREFRESH1_SHIFT       (0)                            /* DAC channel 1 Refresh time */
#define DAC_SHRR_TREFRESH1_MASK        (0xff << DAC_SHRR_TREFRESH1_SHIFT)
#define DAC_SHRR_TREFRESH2_SHIFT       (16)                           /* DAC channel 2 Refresh time */
#define DAC_SHRR_TREFRESH2_MASK        (0xff << DAC_SHRR_TREFRESH2_SHIFT)

/* DAC channel 1/2 sawtooth register register (STR1, STR2) */

#define DAC_STR_STRSTDATA_SHIFT        (0)                            /* DAC channel 1 Sawtooth starting value */
#define DAC_STR_STRSTDATA_MASK         (0xfff << DAC_STR1_STRSTDATA1_SHIFT)
#define DAC_STR_STDIR                  (1 << 12)                      /* DAC channel 1 Sawtooth direction setting */
#define DAC_STR_STINCDATA_SHIFT        (16)                           /* DAC channel 1 Sawtooth increment value (12.4 bit format) */
#define DAC_STR_STINCDATA_MASK         (0xffff << DAC_STR_STINCDATA_SHIFT)

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32GXXXXX_DAC_H */
